<a href="https://colab.research.google.com/github/tejpal123456789/Data-Visualization-techinques/blob/main/pandas_complete.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# PANDAS 
## DTATFRAME AND SERIES

import pandas as pd
data={'one':[1,11,111],'two':[2,22,222]}
dataframe=pd.DataFrame(data)
dataframe

   one  two
0    1    2
1   11   22
2  111  222

In [ ]:
type(dataframe['one'])
df=pd.read_csv('/content/drive/MyDrive/data_deep_learning/bengaluru_real_estate.csv')
df.head()

              area_type   availability  ... balcony   price
0  Super built-up  Area         19-Dec  ...     1.0   39.07
1            Plot  Area  Ready To Move  ...     3.0  120.00
2        Built-up  Area  Ready To Move  ...     3.0   62.00
3  Super built-up  Area  Ready To Move  ...     1.0   95.00
4  Super built-up  Area  Ready To Move  ...     1.0   51.00

[5 rows x 9 columns]

In [ ]:
df1=df[['area_type','location']]

                  area_type                  location
0      Super built-up  Area  Electronic City Phase II
1                Plot  Area          Chikka Tirupathi
2            Built-up  Area               Uttarahalli
3      Super built-up  Area        Lingadheeranahalli
4      Super built-up  Area                  Kothanur
...                     ...                       ...
13315        Built-up  Area                Whitefield
13316  Super built-up  Area             Richards Town
13317        Built-up  Area     Raja Rajeshwari Nagar
13318  Super built-up  Area           Padmanabhanagar
13319  Super built-up  Area              Doddathoguru

[13320 rows x 2 columns]

In [ ]:
# info , dupicated and drop
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [ ]:
df.describe()

               bath       balcony         price
count  13247.000000  12711.000000  13320.000000
mean       2.692610      1.584376    112.565627
std        1.341458      0.817263    148.971674
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     72.000000
75%        3.000000      2.000000    120.000000
max       40.000000      3.000000   3600.000000

In [ ]:
df=df.duplicated().sum()

529

In [ ]:
df.append(df)

                  area_type   availability  ... balcony   price
0      Super built-up  Area         19-Dec  ...     1.0   39.07
1                Plot  Area  Ready To Move  ...     3.0  120.00
2            Built-up  Area  Ready To Move  ...     3.0   62.00
3      Super built-up  Area  Ready To Move  ...     1.0   95.00
4      Super built-up  Area  Ready To Move  ...     1.0   51.00
...                     ...            ...  ...     ...     ...
13315        Built-up  Area  Ready To Move  ...     0.0  231.00
13316  Super built-up  Area  Ready To Move  ...     NaN  400.00
13317        Built-up  Area  Ready To Move  ...     1.0   60.00
13318  Super built-up  Area         18-Jun  ...     1.0  488.00
13319  Super built-up  Area  Ready To Move  ...     1.0   17.00

[26640 rows x 9 columns]

In [ ]:
df=df.drop_duplicates()
df.shape

(12791, 9)

In [ ]:
# columns
import numpy as np
df.columns
len(df.columns)
df.rename(columns={'location':'Location'})

                  area_type   availability  ... balcony   price
0      Super built-up  Area         19-Dec  ...     1.0   39.07
1                Plot  Area  Ready To Move  ...     3.0  120.00
2            Built-up  Area  Ready To Move  ...     3.0   62.00
3      Super built-up  Area  Ready To Move  ...     1.0   95.00
4      Super built-up  Area  Ready To Move  ...     1.0   51.00
...                     ...            ...  ...     ...     ...
13314  Super built-up  Area  Ready To Move  ...     3.0  112.00
13315        Built-up  Area  Ready To Move  ...     0.0  231.00
13316  Super built-up  Area  Ready To Move  ...     NaN  400.00
13317        Built-up  Area  Ready To Move  ...     1.0   60.00
13318  Super built-up  Area         18-Jun  ...     1.0  488.00

[12791 rows x 9 columns]

In [ ]:
# is nan and is null
df.head()

              area_type   availability  ... balcony   price
0  Super built-up  Area         19-Dec  ...     1.0   39.07
1            Plot  Area  Ready To Move  ...     3.0  120.00
2        Built-up  Area  Ready To Move  ...     3.0   62.00
3  Super built-up  Area  Ready To Move  ...     1.0   95.00
4  Super built-up  Area  Ready To Move  ...     1.0   51.00

[5 rows x 9 columns]

In [ ]:
df.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5328
total_sqft         0
bath              73
balcony          605
price              0
dtype: int64

In [ ]:
df.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5328
total_sqft         0
bath              73
balcony          605
price              0
dtype: int64

In [ ]:
df.dropna().isnull().sum()

area_type       0
availability    0
location        0
size            0
society         0
total_sqft      0
bath            0
balcony         0
price           0
dtype: int64

In [ ]:
# imputation
df.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5328
total_sqft         0
bath              73
balcony          605
price              0
dtype: int64

In [ ]:
# Lambda function in dataframes
df['Total_square_sqft']=df['total_sqft'].apply(lambda x:x*2)

In [ ]:
df.head()

              area_type   availability  ...   price Total_square_sqft
0  Super built-up  Area         19-Dec  ...   39.07          10561056
1            Plot  Area  Ready To Move  ...  120.00          26002600
2        Built-up  Area  Ready To Move  ...   62.00          14401440
3  Super built-up  Area  Ready To Move  ...   95.00          15211521
4  Super built-up  Area  Ready To Move  ...   51.00          12001200

[5 rows x 10 columns]